bdrr77/Gecko_SDK/v2.7/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22c111f352gm32.h
/** Part number */

/* If part number is not defined as compiler option, define it */
#if !defined(EFR32MG22C111F352GM32)
#define EFR32MG22C111F352GM32    1 /**< FULL Part */
#endif

/** Configure part number */
#define PART_NUMBER                              "EFR32MG22C111F352GM32" /**< Part Number */

/** Family / Line / Series / Config */
#define _EFR32_MIGHTY_FAMILY                     1                                  /** Device Family Name Identifier */
#define _EFR32_MG_FAMILY                         1                                  /** Device Family Identifier */
#define _EFR_DEVICE                              1                                  /** Product Line Identifier */
#define _SILICON_LABS_32B_SERIES_2                                                  /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES                 2                                  /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG_2                                         /** Product Config Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG        2                                  /** Product Config Identifier */
#define _SILICON_LABS_GECKO_INTERNAL_SDID        205                                /** Silicon Labs internal use only */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_205                                       /** Silicon Labs internal use only */
#define _SILICON_LABS_SECURITY_FEATURE_SE        0                                  /** Secure Element */
#define _SILICON_LABS_SECURITY_FEATURE_VAULT     1                                  /** Vault */
#define _SILICON_LABS_SECURITY_FEATURE_ROT       2                                  /** Root Of Trust */
#define _SILICON_LABS_SECURITY_FEATURE           _SILICON_LABS_SECURITY_FEATURE_ROT /** Security feature set */
#define _SILICON_LABS_EFR32_RADIO_NONE           0                                  /** No radio present */
#define _SILICON_LABS_EFR32_RADIO_SUBGHZ         1                                  /** Radio supports Sub-GHz */
#define _SILICON_LABS_EFR32_RADIO_2G4HZ          2                                  /** Radio supports 2.4 GHz */
#define _SILICON_LABS_EFR32_RADIO_DUALBAND       3                                  /** Radio supports dual band */
#define _SILICON_LABS_EFR32_RADIO_TYPE           _SILICON_LABS_EFR32_RADIO_2G4HZ    /** Radio type */
#define LFRCO_PRECISION_MODE                     false                              /** Precision mode of LFRCO enabled or disabled */

/** Memory Base addresses and limits */
#define MSC_FLASH_MEM_BASE                       (0x00000000UL) /** MSC_FLASH base address */
#define MSC_FLASH_MEM_SIZE                       (0x00080000UL) /** MSC_FLASH avaliable address space */
#define MSC_FLASH_MEM_END                        (0x0007FFFFUL) /** MSC_FLASH end address */
#define MSC_FLASH_MEM_BITS                       (0x14UL)       /** MSC_FLASH used bits */
#define FLASH_MEM_BASE                           (0x00000000UL) /** FLASH_MEM base address */
#define FLASH_MEM_SIZE                           (0x00080000UL) /** FLASH_MEM avaliable address space */
#define FLASH_MEM_END                            (0x0007FFFFUL) /** FLASH_MEM end address */
#define FLASH_MEM_BITS                           (0x14UL)       /** FLASH_MEM used bits */
#define MSC_FLASH_USERDATA_MEM_BASE              (0x0FE00000UL) /** MSC_FLASH_USERDATA base address */
#define MSC_FLASH_USERDATA_MEM_SIZE              (0x00000400UL) /** MSC_FLASH_USERDATA avaliable address space */
#define MSC_FLASH_USERDATA_MEM_END               (0x0FE003FFUL) /** MSC_FLASH_USERDATA end address */
#define MSC_FLASH_USERDATA_MEM_BITS              (0xBUL)        /** MSC_FLASH_USERDATA used bits */
#define USERDATA_BASE                            (0x0FE00000UL) /** USERDATA base address */
#define USERDATA_SIZE                            (0x00000400UL) /** USERDATA avaliable address space */
#define USERDATA_END                             (0x0FE003FFUL) /** USERDATA end address */
#define USERDATA_BITS                            (0xBUL)        /** USERDATA used bits */
#define MSC_FLASH_DEVINFO_MEM_BASE               (0x0FE08000UL) /** MSC_FLASH_DEVINFO base address */
#define MSC_FLASH_DEVINFO_MEM_SIZE               (0x00000400UL) /** MSC_FLASH_DEVINFO avaliable address space */
#define MSC_FLASH_DEVINFO_MEM_END                (0x0FE083FFUL) /** MSC_FLASH_DEVINFO end address */
#define MSC_FLASH_DEVINFO_MEM_BITS               (0xBUL)        /** MSC_FLASH_DEVINFO used bits */
#define MSC_FLASH_CHIPCONFIG_MEM_BASE            (0x0FE0E000UL) /** MSC_FLASH_CHIPCONFIG base address */
#define MSC_FLASH_CHIPCONFIG_MEM_SIZE            (0x00000600UL) /** MSC_FLASH_CHIPCONFIG avaliable address space */
#define MSC_FLASH_CHIPCONFIG_MEM_END             (0x0FE0E5FFUL) /** MSC_FLASH_CHIPCONFIG end address */
#define MSC_FLASH_CHIPCONFIG_MEM_BITS            (0xBUL)        /** MSC_FLASH_CHIPCONFIG used bits */
#define DMEM_RAM0_RAM_MEM_BASE                   (0x20000000UL) /** DMEM_RAM0_RAM base address */
#define DMEM_RAM0_RAM_MEM_SIZE                   (0x00008000UL) /** DMEM_RAM0_RAM avaliable address space */
#define DMEM_RAM0_RAM_MEM_END                    (0x20007FFFUL) /** DMEM_RAM0_RAM end address */
#define DMEM_RAM0_RAM_MEM_BITS                   (0x10UL)       /** DMEM_RAM0_RAM used bits */
#define RAM_MEM_BASE                             (0x20000000UL) /** RAM_MEM base address */
#define RAM_MEM_SIZE                             (0x00008000UL) /** RAM_MEM avaliable address space */
#define RAM_MEM_END                              (0x20007FFFUL) /** RAM_MEM end address */
#define RAM_MEM_BITS                             (0x10UL)       /** RAM_MEM used bits */
#define CRYPTOACC_RNGOUT_FIFO_S_MEM_BASE         (0x4C024000UL) /** CRYPTOACC_RNGOUT_FIFO_S base address */
#define CRYPTOACC_RNGOUT_FIFO_S_MEM_SIZE         (0x00004000UL) /** CRYPTOACC_RNGOUT_FIFO_S avaliable address space */
#define CRYPTOACC_RNGOUT_FIFO_S_MEM_END          (0x4C027FFFUL) /** CRYPTOACC_RNGOUT_FIFO_S end address */
#define CRYPTOACC_RNGOUT_FIFO_S_MEM_BITS         (0xFUL)        /** CRYPTOACC_RNGOUT_FIFO_S used bits */
#define CRYPTOACC_PKRAM_MAIN_S_MEM_BASE          (0x4C028000UL) /** CRYPTOACC_PKRAM_MAIN_S base address */
#define CRYPTOACC_PKRAM_MAIN_S_MEM_SIZE          (0x00001000UL) /** CRYPTOACC_PKRAM_MAIN_S avaliable address space */
#define CRYPTOACC_PKRAM_MAIN_S_MEM_END           (0x4C028FFFUL) /** CRYPTOACC_PKRAM_MAIN_S end address */
#define CRYPTOACC_PKRAM_MAIN_S_MEM_BITS          (0xDUL)        /** CRYPTOACC_PKRAM_MAIN_S used bits */
#define CRYPTOACC_RNGOUT_FIFO_NS_MEM_BASE        (0x5C024000UL) /** CRYPTOACC_RNGOUT_FIFO_NS base address */
#define CRYPTOACC_RNGOUT_FIFO_NS_MEM_SIZE        (0x00004000UL) /** CRYPTOACC_RNGOUT_FIFO_NS avaliable address space */
#define CRYPTOACC_RNGOUT_FIFO_NS_MEM_END         (0x5C027FFFUL) /** CRYPTOACC_RNGOUT_FIFO_NS end address */
#define CRYPTOACC_RNGOUT_FIFO_NS_MEM_BITS        (0xFUL)        /** CRYPTOACC_RNGOUT_FIFO_NS used bits */
#define CRYPTOACC_RNGOUT_FIFO_MEM_BASE           (0x5C024000UL) /** CRYPTOACC_RNGOUT_FIFO_MEM base address */
#define CRYPTOACC_RNGOUT_FIFO_MEM_SIZE           (0x00004000UL) /** CRYPTOACC_RNGOUT_FIFO_MEM avaliable address space */
#define CRYPTOACC_RNGOUT_FIFO_MEM_END            (0x5C027FFFUL) /** CRYPTOACC_RNGOUT_FIFO_MEM end address */
#define CRYPTOACC_RNGOUT_FIFO_MEM_BITS           (0xFUL)        /** CRYPTOACC_RNGOUT_FIFO_MEM used bits */
#define CRYPTOACC_PKRAM_MAIN_NS_MEM_BASE         (0x5C028000UL) /** CRYPTOACC_PKRAM_MAIN_NS base address */
#define CRYPTOACC_PKRAM_MAIN_NS_MEM_SIZE         (0x00001000UL) /** CRYPTOACC_PKRAM_MAIN_NS avaliable address space */
#define CRYPTOACC_PKRAM_MAIN_NS_MEM_END          (0x5C028FFFUL) /** CRYPTOACC_PKRAM_MAIN_NS end address */
#define CRYPTOACC_PKRAM_MAIN_NS_MEM_BITS         (0xDUL)        /** CRYPTOACC_PKRAM_MAIN_NS used bits */
#define CRYPTOACC_PKRAM_MAIN_MEM_BASE            (0x5C028000UL) /** CRYPTOACC_PKRAM_MAIN_MEM base address */
#define CRYPTOACC_PKRAM_MAIN_MEM_SIZE            (0x00001000UL) /** CRYPTOACC_PKRAM_MAIN_MEM avaliable address space */
#define CRYPTOACC_PKRAM_MAIN_MEM_END             (0x5C028FFFUL) /** CRYPTOACC_PKRAM_MAIN_MEM end address */
#define CRYPTOACC_PKRAM_MAIN_MEM_BITS            (0xDUL)        /** CRYPTOACC_PKRAM_MAIN_MEM used bits */
#define RDMEM_SEQRAM_S_MEM_BASE                  (0xA0000000UL) /** RDMEM_SEQRAM_S base address */
#define RDMEM_SEQRAM_S_MEM_SIZE                  (0x00004000UL) /** RDMEM_SEQRAM_S avaliable address space */
#define RDMEM_SEQRAM_S_MEM_END                   (0xA0003FFFUL) /** RDMEM_SEQRAM_S end address */
#define RDMEM_SEQRAM_S_MEM_BITS                  (0xFUL)        /** RDMEM_SEQRAM_S used bits */
#define RDMEM_FRCRAM_S_MEM_BASE                  (0xA0004000UL) /** RDMEM_FRCRAM_S base address */
#define RDMEM_FRCRAM_S_MEM_SIZE                  (0x00001000UL) /** RDMEM_FRCRAM_S avaliable address space */
#define RDMEM_FRCRAM_S_MEM_END                   (0xA0004FFFUL) /** RDMEM_FRCRAM_S end address */
#define RDMEM_FRCRAM_S_MEM_BITS                  (0xDUL)        /** RDMEM_FRCRAM_S used bits */
#define RDMEM_SEQRAM_NS_MEM_BASE                 (0xB0000000UL) /** RDMEM_SEQRAM_NS base address */
#define RDMEM_SEQRAM_NS_MEM_SIZE                 (0x00004000UL) /** RDMEM_SEQRAM_NS avaliable address space */
#define RDMEM_SEQRAM_NS_MEM_END                  (0xB0003FFFUL) /** RDMEM_SEQRAM_NS end address */
#define RDMEM_SEQRAM_NS_MEM_BITS                 (0xFUL)        /** RDMEM_SEQRAM_NS used bits */
#define RDMEM_SEQRAM_SEQRAM_MEM_BASE             (0xB0000000UL) /** RDMEM_SEQRAM_SEQRAM_MEM base address */
#define RDMEM_SEQRAM_SEQRAM_MEM_SIZE             (0x00004000UL) /** RDMEM_SEQRAM_SEQRAM_MEM avaliable address space */
#define RDMEM_SEQRAM_SEQRAM_MEM_END              (0xB0003FFFUL) /** RDMEM_SEQRAM_SEQRAM_MEM end address */
#define RDMEM_SEQRAM_SEQRAM_MEM_BITS             (0xFUL)        /** RDMEM_SEQRAM_SEQRAM_MEM used bits */
#define RDMEM_FRCRAM_NS_MEM_BASE                 (0xB0004000UL) /** RDMEM_FRCRAM_NS base address */
#define RDMEM_FRCRAM_NS_MEM_SIZE                 (0x00001000UL) /** RDMEM_FRCRAM_NS avaliable address space */
#define RDMEM_FRCRAM_NS_MEM_END                  (0xB0004FFFUL) /** RDMEM_FRCRAM_NS end address */
#define RDMEM_FRCRAM_NS_MEM_BITS                 (0xDUL)        /** RDMEM_FRCRAM_NS used bits */
#define RDMEM_FRCRAM_FRCRAM_MEM_BASE             (0xB0004000UL) /** RDMEM_FRCRAM_FRCRAM_MEM base address */
#define RDMEM_FRCRAM_FRCRAM_MEM_SIZE             (0x00001000UL) /** RDMEM_FRCRAM_FRCRAM_MEM avaliable address space */
#define RDMEM_FRCRAM_FRCRAM_MEM_END              (0xB0004FFFUL) /** RDMEM_FRCRAM_FRCRAM_MEM end address */
#define RDMEM_FRCRAM_FRCRAM_MEM_BITS             (0xDUL)        /** RDMEM_FRCRAM_FRCRAM_MEM used bits */

/** Flash and SRAM limits for EFR32MG22C111F352GM32 */
#define FLASH_BASE                               (0x00000000UL) /**< Flash Base Address */
#define FLASH_SIZE                               (0x00058000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE                          (0x00002000UL) /**< Flash Memory page size */
#define SRAM_BASE                                (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                                (0x00008000UL) /**< Available SRAM Memory */
#define DMA_CHAN_COUNT                           LDMA_CH_NUM    /**< Number of DMA channels */
#define EXT_IRQ_COUNT                            64             /**< Number of External (NVIC) interrupts */

